<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DistrictSeeder extends Seeder
{
    public function run(): void
    {
        $districts = [
            'কিশোরগঞ্জ',
            'কুমিল্লা',
            'কক্সবাজার',
            'কুড়িগ্রাম',
            'কুষ্টিয়া',
            'খাগড়াছড়ি',
            'খুলনা',
            'গাইবান্ধা',
            'গাজীপুর',
            'গোপালগঞ্জ',
            'চাঁদপুর',
            'চাঁপাইনবাবগঞ্জ',
            'চট্টগ্রাম',
            'চুয়াডাঙ্গা',
            'জামালপুর',
            'জয়পুরহাট',
            'ঝালকাঠি',
            'ঝিনাইদহ',
            'টাঙ্গাইল',
            'ঠাকুরগাঁও',
            'দিনাজপুর',
            'ঢাকা',
            'নড়াইল',
            'নওগাঁ',
            'নাটোর',
            'নারায়ণগঞ্জ',
            'নরসিংদী',
            'নেত্রকোনা',
            'নীলফামারী',
            'নোয়াখালী',
            'পটুয়াখালী',
            'পঞ্চগড়',
            'পাবনা',
            'পিরোজপুর',
            'ফরিদপুর',
            'ফেনী',
            'বাগেরহাট',
            'বগুড়া',
            'বরগুনা',
            'বরিশাল',
            'বান্দরবান',
            'ব্রাহ্মণবাড়িয়া',
            'ভোলা',
            'মাগুরা',
            'মাদারীপুর',
            'মানিকগঞ্জ',
            'মেহেরপুর',
            'মৌলভীবাজার',
            'মুন্সীগঞ্জ',
            'ময়মনসিংহ',
            'যশোর',
            'রংপুর',
            'রাঙ্গামাটি',
            'রাজবাড়ী',
            'রাজশাহী',
            'লালমনিরহাট',
            'লক্ষ্মীপুর',
            'শরীয়তপুর',
            'শেরপুর',
            'সিরাজগঞ্জ',
            'সুনামগঞ্জ',
            'সাতক্ষীরা',
            'সিলেট',
            'হবিগঞ্জ'
        ];

        // Table clean করে নতুন করে insert করা
        DB::table('districts')->truncate();

        $now = now();
        $data = [];
        foreach ($districts as $district) {
            $data[] = [
                'name' => $district,
                'created_at' => $now,
                'updated_at' => $now
            ];
        }

        DB::table('districts')->insert($data);
    }
}
